[
  {
    "id": "1",
    "order": 3,
    "title": "Sr. Systems Analyst & Interaction Leader",
    "dates": "March 2020 - Present",
    "duties": [
       "Interaction Leader: Leader of a team with 4 developers and 1 Scrum Master",
      "FullStack Developer: Working as a fullstack developer in the Digital Payments Solutions. The solution is composed by Mobile(Wallet), Front(Transaction Controls) and Backend(Integrations and Cryptograph) Solutions that works in the entire flow of the digital payments. Stack: Java(Spring Boot, ANT, Maven, Open-Api, API-First Design, Junit), ReactJS, Docker, Jenkins, RabbitMQ, ShellScript, Postgresql, MongoDB, Elastik, Swagger, Wildfly and Crypto algorithm.",
      "Solutions Architect: Specifications of payments integrations solutions. Stack: DrawIO and WebSequence"
      ],
    "company": "HST Card Technology",
    "companyDescription": "HST provides security operations in payments solutions"
  },
  {
    "id": "2",
    "order": 2,
    "title": "System Analyst",
    "dates": "May 2017 - March 2020",
    "duties": [
      "Software Engineer: Worked as a contractor for Motorola Solutions(Chicago) team developing integrations with the Command Central system to APIs(REST and Soap). Stacks: Javascript, Typescript, Java, Azure, Azure Service Bus, Gitlab, Docker, Kubernetes, REST, CID/CD, SOAP and NSIS.",
      "FullStack Developer: Development of a Ícaro Tech internal product named Flex Forward used to generate reports for customers needs. Stacks: ReactJS, Java, Javascript, Docker and Gitlab."
    ],
    "company": "Icaro Tech",
    "companyDescription": "Process Automation"
  },
  {
    "id": "3",
    "order": 3,
    "title": "System Technician",
    "dates": "Dev 2012 - May 2017",
    "duties": [
      "Backend Developer: Creation of process automation for excel operations using VBA Macro as programming language"
    ],
    "company": "CPqD",
    "companyDescription": "Process Automation / Audit / Inovation"
  },
  {
    "id": "4",
    "order": 4,
    "title": "System Technician",
    "dates": "Feb 2012 - Dev 2012",
    "duties": [
      "Website support: Used a internal tool to update website content, as new, products and etc.",
      "IT Support: Worked as an internal team support for everything related to laptops and networks issue."
    ],
    "company": "Master Certificações",
    "companyDescription": "Certifications / Audit"
  },
  {
    "id": "5",
    "order": 5,
    "title": "Intern",
    "dates": "Nov 2011 - Feb 2012",
    "duties": [
      "Website Development: Development of a website used as a blog, constructed using Html, CSS and Javascript."
    ],
    "company": "Clinica IBTA",
    "companyDescription": "Health"
  }
]
